espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_adc.h
#if defined(_ADC_SCANCTRLX_FIFOOFACT_MASK)
  /** When true, FIFO overwrites old data when full. If false, FIFO discards new data.
      The SINGLEOF IRQ is triggered in both cases. */
  bool                fifoOverwrite;
#endif
} ADC_InitScan_TypeDef;

/** Default configuration for ADC scan initialization structure. */
#if defined(_ADC_SCANCTRL_INPUTMASK_MASK)
#define ADC_INITSCAN_DEFAULT                                                      \
  {                                                                               \
    adcPRSSELCh0,            /* PRS ch0 (if enabled). */                          \
    adcAcqTime1,             /* 1 ADC_CLK cycle acquisition time. */              \
    adcRef1V25,              /* 1.25 V internal reference. */                     \
    adcRes12Bit,             /* 12 bit resolution. */                             \
    0,                       /* No input selected. */                             \
    false,                   /* Single-ended input. */                            \
    false,                   /* PRS disabled. */                                  \
    false,                   /* Right adjust. */                                  \
    false,                   /* Deactivate conversion after one scan sequence. */ \
  }
#endif

#if defined(_ADC_SCANINPUTSEL_MASK)
#define ADC_INITSCAN_DEFAULT                                                          \
  {                                                                                   \
    adcPRSSELCh0,            /* PRS ch0 (if enabled). */                              \
    adcAcqTime1,             /* 1 ADC_CLK cycle acquisition time. */                  \
    adcRef1V25,              /* 1.25 V internal reference. */                         \
    adcRes12Bit,             /* 12 bit resolution. */                                 \
    {                                                                                 \
      /* Initialization should match values set by @ref ADC_ScanInputClear(). */      \
      ADC_SCANINPUTSEL_NONE, /* Default ADC inputs. */                                \
      0,                     /* Default input mask (all off). */                      \
      _ADC_SCANNEGSEL_RESETVALUE,/* Default negative select for positive terminal. */ \
    },                                                                                \
    false,                   /* Single-ended input. */                                \
    false,                   /* PRS disabled. */                                      \
    false,                   /* Right adjust. */                                      \
    false,                   /* Deactivate conversion after one scan sequence. */     \
    false,                   /* No EM2 DMA wakeup from scan FIFO DVL. */              \
    false                    /* Discard new data on full FIFO. */                     \
  }
#endif

/** Single conversion initialization structure. */
typedef struct {
  /**
   * Peripheral reflex system trigger selection. Only applicable if @p prsEnable
   * is enabled.
   */
  ADC_PRSSEL_TypeDef            prsSel;

  /** Acquisition time (in ADC clock cycles). */
  ADC_AcqTime_TypeDef           acqTime;

  /**
   * Sample reference selection. Note that, for external references, the
   * ADC calibration register must be set explicitly.
   */
  ADC_Ref_TypeDef               reference;

  /** Sample resolution. */
  ADC_Res_TypeDef               resolution;

#if defined(_ADC_SINGLECTRL_INPUTSEL_MASK)
  /**
   * Sample input selection, use single-ended or differential input according
   * to setting of @p diff.
   */
  ADC_SingleInput_TypeDef       input;
#endif

#if defined(_ADC_SINGLECTRL_POSSEL_MASK)
  /** Select positive input for single channel conversion mode. */
  ADC_PosSel_TypeDef            posSel;
#endif

#if defined(_ADC_SINGLECTRL_NEGSEL_MASK)
  /** Select negative input for single channel conversion mode. Negative input is grounded
      for single-ended (non-differential) conversion.  */
  ADC_NegSel_TypeDef            negSel;
#endif

  /** Select if single-ended or differential input. */
  bool                          diff;

  /** Peripheral reflex system trigger enable. */
  bool                          prsEnable;

  /** Select if left adjustment should be done. */
  bool                          leftAdjust;

  /** Select if continuous conversion until explicit stop. */
  bool                          rep;

#if defined(_ADC_CTRL_SINGLEDMAWU_MASK)
  /** When true, DMA is available in EM2 for single conversion */
  bool                          singleDmaEm2Wu;
#endif

#if defined(_ADC_SINGLECTRLX_FIFOOFACT_MASK)
  /** When true, FIFO overwrites old data when full. If false, FIFO discards new data.
      The SCANOF IRQ is triggered in both cases. */
  bool                          fifoOverwrite;
#endif
} ADC_InitSingle_TypeDef;

/** Default configuration for ADC single conversion initialization structure. */
#if defined(_ADC_SINGLECTRL_INPUTSEL_MASK)
#define ADC_INITSINGLE_DEFAULT                                                    \
  {                                                                               \
    adcPRSSELCh0,            /* PRS ch0 (if enabled). */                          \
    adcAcqTime1,             /* 1 ADC_CLK cycle acquisition time. */              \
    adcRef1V25,              /* 1.25 V internal reference. */                     \
    adcRes12Bit,             /* 12 bit resolution. */                             \
    adcSingleInpCh0,         /* CH0 input selected. */                            \
    false,                   /* Single-ended input. */                            \
    false,                   /* PRS disabled. */                                  \
    false,                   /* Right adjust. */                                  \
    false                    /* Deactivate conversion after one scan sequence. */ \
  }
#else
#define ADC_INITSINGLE_DEFAULT                                                    \
  {                                                                               \
    adcPRSSELCh0,            /* PRS ch0 (if enabled). */                          \
    adcAcqTime1,             /* 1 ADC_CLK cycle acquisition time. */              \
    adcRef1V25,              /* 1.25 V internal reference. */                     \
    adcRes12Bit,             /* 12 bit resolution. */                             \
    adcPosSelAPORT0XCH0,     /* Select node BUS0XCH0 as posSel */                 \
    adcNegSelVSS,            /* Select VSS as negSel */                           \
    false,                   /* Single-ended input. */                            \
    false,                   /* PRS disabled. */                                  \
    false,                   /* Right adjust. */                                  \
    false,                   /* Deactivate conversion after one scan sequence. */ \
    false,                   /* No EM2 DMA wakeup from single FIFO DVL */         \
    false                    /* Discard new data on full FIFO. */                 \
  }
#endif

